backend/src/test/jmeter/report_login/statistics.json
{
  "Total" : {
    "transaction" : "Total",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 88.54300000000002,
    "medianResTime" : 88.0,
    "minResTime" : 69.0,
    "maxResTime" : 446.0,
    "pct1ResTime" : 102.0,
    "pct2ResTime" : 107.0,
    "pct3ResTime" : 122.99000000000001,
    "throughput" : 16.640319494134285,
    "receivedKBytesPerSec" : 6.547136955029536,
    "sentKBytesPerSec" : 3.4433273618853484
  },
  "PUT /users/login" : {
    "transaction" : "PUT /users/login",
    "sampleCount" : 1000,
    "errorCount" : 0,
    "errorPct" : 0.0,
    "meanResTime" : 88.54300000000002,
    "medianResTime" : 88.0,
    "minResTime" : 69.0,
    "maxResTime" : 446.0,
    "pct1ResTime" : 102.0,
    "pct2ResTime" : 107.0,
    "pct3ResTime" : 122.99000000000001,
    "throughput" : 16.640319494134285,
    "receivedKBytesPerSec" : 6.547136955029536,
    "sentKBytesPerSec" : 3.4433273618853484
  }
}